# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) —
# на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.


from time import sleep


class Trafficlight:
    # задаем атрибуты класса
    __color = ['green', 'yellow', 'red']

    # Задаем методы класса
    def lights_on(self):
        i = 0
        while i < 3:
            print(f'Trafficlight switching \n'
                  f'{Trafficlight.__color[i]}')
            if i == 0:
                sleep(10)
            elif i == 1:
                sleep(2)
            elif i == 2:
                sleep(7)
            i += 1


Trafficlight = Trafficlight()
Trafficlight.lights_on()
